{
  "blogs": [
    {
      "id": "whFkOLh3omQNh0h6-zYWd",
      "date": "2023-12-25T20:21:17.778Z",
      "title": "دوره ی داکر برای همه",
      "content": "داکر دنیای اپلیکیشن های مدرن را تغییر داد، قدرتی که داکر به توسعه دهندگان و متخصصین دواپس برای کنترل بیشتر و بهتر برنامه و تجربه ی توسعه و دیپلوی یکسان میدهد با هیچ چیزی که قبلا تجربه کرده اید قابل مقایسه نیست! با دوره 'داکر برای همه'، از دنیای تکنولوژی عقب نمانید!",
      "user": "sIQRSqQmsED76H-zsMz4W",
      "reactions": {
        "thumbsUp": 0,
        "hooray": 0,
        "heart": 0,
        "rocket": 0,
        "eyes": 0
      }
    },
    {
      "id": "RfVp_Nwp6My9ZPYG8FAfI",
      "date": "2023-12-25T20:22:28.592Z",
      "title": "دوره ی متخصص NestJs",
      "content": "نست جی اس (NestJS) یک فریمورک قدرتمند و محبوب برای Node.js و برنامه های سمت سرور مبتنی بر تایپ اسکریپت است که میتوان برنامه هایی  با مقیاس و سطح بالا با کمترین زمان و کدنویسی ممکن توسعه داد هچنین یادگیری این فریمورک از مهارت های مهم و تخصصی در  حوزه ی بک اند Node.js می باشد و این دوره اولین و بزرگترین دوره ی تخصصی در ایران به عنوان دوره مهارت محور و متخصص نست جی اس (NestJS) میباشد",
      "user": "M_vFMKsssx1mIJ2fcSl1l",
      "reactions": {
        "thumbsUp": 0,
        "hooray": 0,
        "heart": 0,
        "rocket": 0,
        "eyes": 0
      }
    },
    {
      "id": "pFoyV9aWJ0_ZZx5YSB5_H",
      "date": "2023-12-25T20:23:15.608Z",
      "title": "آموزش ReactJs ( مقدماتی تا پیشرفته )",
      "content": "آموزش صفر تا صد ReactJs\nامروزه ReactJs به سرعت در حال تبدیل شدن به یک ابزار بسیار قدرتمند برای ساخت وب اپلیکیشن ها است و خیلی از معروفترین سایت ها از جمله فیسبوک , توییتر, نتفلیکس , یاهو , اینستاگرام و غیره همه در حال استفاده از این ابزار بسیار قدرتمند برای هرچه سریعتر و کارآمدتر کردن سایت و وب اپلیکیشن های خود هستند.\nری اکت برخلاف سایر رقبای خود که فریم ورک هستند یک کتابخانه جاوااسکریپت است پس نسبت به رقبای خود روند یادگیری کوتاه تری را دارد و یکی از بهترین ویژگی های ری اکت دادن قدرت انتخاب به توسعه دهندگان برای انتخاب ابزارهای مورد علاقه آنهاست برخلاف رقبای خود که توسعه دهندگان تنها باید از ابزارهای قرار داده شده استفاده کنند و در شرایطی با یک بروزرسانی کوچک باید اکثر مواردی که استفاده شده دوباره بعد یادگیری مجدد بازنویسی کنند.\nری اکت بسیار سریع و کارآمد و محبوبترین کتابخانه جاوااسکریپت می باشد به این معنی است که تعداد توسعه دهندگان بسیار زیادی دارد که این باعث می شود خیلی از ابزارهای مورد نیاز موجود باشد و مهمتر از همه هر سوالی که براتون پیش بیاد از قبل برای کسی پیش آمده و جوابش موجود هست.\n\nدر این دوره سعی میکنیم از صفر (مباحث پایه) شروع کنیم تا با ریتمی آهسته به همراه مثال و تمرینات به بخش های پیشرفته برسیم .این دوره دانشجو محور خواهد بود و تمامی نظرات شما دانشجویان عزیز درنظر گرفته می شود تا در کنار هم یک دوره کامل بسازیم.این دوره طوری طراحی شده است که بعد از اتمام بتوانید بدون نیاز به آموزش های دیگر راه خودتان را برای ورود به بازار کار و حرفه ایی شدن پیدا کنید.\n\nسرفصل های دوره :\n\nمعرفی دوره \n\nمباحث پایه ری اکت\n\nآشنایی با ContextAPI  و Hooks\n\nیادگیری React Router\n\nیادگیری Material UI\n\nنحوه Build  و آنلاین کردن اپلیکیشن ری اکتی\n\nیادگیری Redux  و Redux Thunk\n\nیادگیری مباحث پایه NextJs\n\nآشنایی با ‍PWA\n\nتست نویسی در ری اکت توسط کتابخانه Jest",
      "user": "gq62_2dGBYSiuuSi8YRqm",
      "reactions": {
        "thumbsUp": 0,
        "hooray": 0,
        "heart": 0,
        "rocket": 0,
        "eyes": 0
      }
    },
    {
      "id": "GYjbdpqfc4n676BTE2_Ym",
      "date": "2023-12-26T07:39:09.904Z",
      "title": "دوره ی لذت طراحی با تیلویند",
      "content": "Tailwind CSS یک فریم ورک سی اس اس برای نوشتن سریع و بهینه استایل های مورد نیاز وبسایت است. با استفاده از تیلویند، می توانید در سریع ترین زمان ممکن وبسایت هایی مدرن و بهینه با کمترین حجم کد های CSS را ساخته و رابط کاربری آن را توسعه دهید. دوره تیلویند کدنایت پروژه محور بوده و همه آن چیزی است که برای یادگیری تیلویند به آن نیاز دارید.",
      "user": "gq62_2dGBYSiuuSi8YRqm",
      "reactions": {
        "thumbsUp": 0,
        "hooray": 0,
        "heart": 0,
        "rocket": 0,
        "eyes": 0
      }
    },
    {
      "id": "TU3sWgk7JIx9wi27ypN4X",
      "date": "2023-12-26T07:40:37.175Z",
      "title": "دوره ی رزومه نویسی",
      "content": "رزومه نویسی یک مهارت بوده و کاملا قابل یادگیري است! 'شانس' در پذیرفته شدن و یا رد شدن رزومه شما هیچگونه تاثیر مستقیمی ندارد؛ علی الخصوص که امروزه بیشتر شرکت ها با کمک بات ها و یا هوش مصنوعی رزومه هاي ارسالی را مورد بررسی قرار میدهند.",
      "user": "gq62_2dGBYSiuuSi8YRqm",
      "reactions": {
        "thumbsUp": 0,
        "hooray": 0,
        "heart": 0,
        "rocket": 0,
        "eyes": 0
      }
    }
  ],
  "users": [
    {
      "id": "gq62_2dGBYSiuuSi8YRqm",
      "fullname": "حسین فلاح",
      "image": "https://avatars.githubusercontent.com/u/98707258?v=4",
      "email": "hosseinfalah2021@gmail.com"
    },
    {
      "id": "iExsNqmDbomZcDBAYJvMU",
      "fullname": "zeynab jafari",
      "image": "https://avatars.githubusercontent.com/u/103099450?v=4",
      "email": "zeynabjafari2002@gmail.com"
    },
    {
      "id": "t3VDTM41ZQ2Lc9TJezscZ",
      "fullname": "Yalda Khoshbahar",
      "image": "https://avatars.githubusercontent.com/u/133539176?v=4",
      "email": "y.khoshbahar2003@gmail.com"
    },
    {
      "id": "M_vFMKsssx1mIJ2fcSl1l",
      "fullname": "Hesam Asnaashari",
      "image": "https://avatars.githubusercontent.com/u/46031836?v=4",
      "email": "HesamAsnaashari@gmail.com"
    },
    {
      "id": "AK5TTBxyUHzFre62UURih",
      "fullname": "amirreza haqi",
      "image": "https://avatars.githubusercontent.com/u/88787993?v=4",
      "email": "amirrezahaqi@gmail.com"
    },
    {
      "id": "sIQRSqQmsED76H-zsMz4W",
      "fullname": "Ali Bahaari",
      "image": "https://avatars.githubusercontent.com/u/8419324?v=4",
      "email": "alibahaari1997@gmail.com"
    }
  ]
}